/*
 * @Author: zhangkangbin
 * @Date: 2022-10-29 13:24:24
 * @LastEditors: zhangkangbin
 * @LastEditTime: 2022-10-29 13:29:33
 * @FilePath: \C_Study\3Test\Test833_2018.cpp
 * @Description: 
 */
/*


（1）简述线性结构特点。（8分）

（2）用C/C++程序语言写出删除单链表表头节点的代码。（12分）
2. 先着色点S，再从右、上、左、下的逆时针顺序依次着色S的邻域。重复这
个过程直到整个区域着色完成。

			1	
	4	8	SSS	
	5	6		
				

（1）简述栈是什么栈的特点是什么（8分）
（2）用栈实现购的着色过程（可用自然语言）。（12分）

3.（1）简述冒泡排序的过程（可以用自然语言）。（8分）
（2）用一个例子体现快速排序的算法过程。（12分）

4.（1）简要说明动态规划是什么，与分治法有什么区别?（10分）
（2）给出例子说明动态规划求解的过程。（10分）

5.（1）分析斐波那契函数的时间复杂度和空间复杂度。（10分）
（2）用C/C++程序语言写出斐波那契函数的递归形式。（10分）


6. 哈夫曼树是自下而上构建的，这与平常的树不一样，设最下面的一层为第一

*/