/*
 * @Author: zhangkangbin
 * @Date: 2022-11-06 11:45:04
 * @LastEditors: zhangkangbin
 * @LastEditTime: 2022-11-22 13:46:19
 * @FilePath: \C_Study\3Test\Test851_2022.cpp
 * @Description: 
 * 
 */
/**
（1）在函数运行过程中，s++执行了多少次（2）x+=2执行次数（3）该程序时间复杂度
（4）当n=5，s和x的输出结果是什么

2、结点数为892的完全二叉树

（1）求完全二叉树的高度
（2）叶子结点个数
（3）单分支结点个数
（4）最后一个非终端节点（即最后一个叶子节点的父节点）的序号，根节点序号为1


3、图论

（1）用 prim 算法实现 MST最小生成树的构造，从A开始求，给出选出的边
（2）图G的MST唯一吗?
（3）对比带权连通图，给出充要条件，使得在这个条件下得到的MST唯一。



4、比较堆排序，归并排序，快速排序

（1）从空间复杂度角度，判断堆排序，快速排序，归并排序哪个最优，哪个其次，哪个最差
（2）从时间复杂度角度，在平均情况下，判断堆排序，快速排序，归并排序哪个最优
（3）从时间复杂度角度分析，并尽量使空间复杂度底，判断三种排序哪个最优

（4）对于序列（29，18，25，47，58，12，51，10}，
使用快速排序，写出每一趟的排序序列；

使用归并排序，写出每一趟的排序序列。（从小到大排序）

5、对于双向链表结构
（1）给出其有存储结构的c语言描述（2）对于双向链表，删除一个节点（代码）

6、C语言
（1）用C语言描述栈的结构体（2）用C语言描述出栈和入栈的算法
（3）结合前两问，实现输入一个十进制数，输出对应八进制数的算法，用c语言描述


7、遍历二叉树
1）二叉树特点是什么，写出链式二叉树遍历的各种方法2）写出先序遍历二叉树递归算法的C语言描述


8、对于B树1）B树定义
2）存储数据结构（用c语言描述b-树的结构体）3）B树查找操作


 * 
 */