/*
 * @Author: zhangkangbin
 * @Date: 2022-10-29 13:24:24
 * @LastEditors: zhangkangbin
 * @LastEditTime: 2022-10-29 13:29:33
 * @FilePath: \C_Study\3Test\Test833_2018.cpp
 * @Description: 
 */
/*

1.给定一个单链表，链表内数字各不相同，删除值为X的结点，并返回头结点，
试设计算法并使用C/C++代码实现。（15分）

2.一个整数数组{2，3，8，10，11，7，20，9，15}，按照该数组元素的顺序，
健立二叉排序树，写出算法思想，写出算法，并在关键处给出注释。（15分）

3. 给定一串数字序列，试用快速排序将其变成有序序列，试设计算法并写出代码。（15分）


4. 栈操作有入栈和出栈，初始时栈为空，如果进行一系列进出栈操作后，栈仍然为空，
那么就称该栈操作是正确的，否则为错误，如果入栈用Ⅰ标出，出栈用O表示，则对手一些序列（15分）
A. IIOOIIO
B. IOIIOOIO
C. IIOIOO
D. IIIOOO，


其中BD操作
是正确的，判断给出一个序列的栈操作是否正确，正确返回TRUE，错误返回FALSE。
（1）给出算法的基本设计思想；
（2）写出该算法，并在关键之处给出注释。

5. 给定一颗二叉树，求出叶子个数，试设计算法并写出代码。（15分）
				
			1	
	4	8	SSS	
	5	6		
				


*/