/*
 * @Author: zhangkangbin
 * @Date: 2022-10-29 13:24:24
 * @LastEditors: zhangkangbin
 * @LastEditTime: 2022-10-29 13:27:05
 * @FilePath: \C_Study\3Test\Test833_2017.cpp
 * @Description: 
 */
/*

2. 设计一个算法，判断一个算数表达式中的括号是否配对。
算数表达式保存在带头结点的单循环链表中，每个结点有两个域ch和link，
其中ch域为字符类型。

（1）写出设计思想；
（2）用C语言编写程序，关键之处给予注释。



3.一颗二叉树，其左右子树都空，或都不空，则为“严格二叉树”，
用先序遍历和后序遍历能确定一颗严格二叉树，二叉树的前序序列为ABDECFHIGJLKMN，
后序序列为DEBHIFLJMNKGCA。

（1）画出二叉树；
（2）根据这类二叉树描述前序序列和后序序列的设计思想；
（3）根据所写的设计思想给出程序。





8. 无向连通常权图的最小生成树可以采用贪心算法求导，如Prim，Kruskal。

（1）描述最小生成树的性质，并证明之;

（2）描述Prim∶ Kruskal思想，并计算时间复杂度。


*/