/*
 * @Author: zhangkangbin
 * @Date: 2022-10-29 13:24:24
 * @LastEditors: zhangkangbin
 * @LastEditTime: 2022-11-04 21:16:33
 * @FilePath: \C_Study\3Test\Test833_2021.cpp
 * @Description: 
 */
/*


（1）简述线性结构特点。（8分）

（2）用C/C++程序语言写出删除单链表表头节点的代码。（12分）
2. 先着色点S，再从右、上、左、下的逆时针顺序依次着色S的邻域。重复这
个过程直到整个区域着色完成。

			1	
	4	8	SSS	
	5	6		
				

（1）简述栈是什么？栈的特点是什么？（8分）
（2）用栈实现点的着色过程（可用自然语言）。（12分）

3.（1）简述冒泡排序的过程（可以用自然语言）。（8分）
（2）用一个例子体现快速排序的算法过程。（12分）

4.（1）简要说明动态规划是什么，与分治法有什么区别?（10分）
（2）给出例子说明动态规划求解的过程。（10分）

5.（1）分析斐波那契函数的时间复杂度和空间复杂度。（10分）
（2）用C/C++程序语言写出斐波那契函数的递归形式。（10分）


6. 哈夫曼树是自下而上构建的，这与平常的树不一样，设最下面的一层为第一层，向上为第二层，依次是第三层，......

（1）写出实现二叉树的链表结构和队列结构；（5分） |

（2）根据上述结构写出哈夫曼树从头结点到叶子结点的算法过程，并且描写具体的实现过程；（10分）

（3）写出实现过程。（10分）



7.
（1）关于有向图，用邻接矩阵表示，如果有边则赋值为1，如果没有边则赋值为0。
设计一个算法，通过这个邻接矩阵直接判断图中任意两个点是否可以连通。
写出你的思想（用自然语言来实现）。

（2）给你一个邻接矩阵，写出用上述算法运行该邻接矩阵的过程，并说明点的可达性。


*/